app/controllers/posts_controller.rb

  def show
    id = params[:id]
    @post = Post.find(id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 23]]

  def create

    params[:post][:release_time] = Time.now.getutc
    params[:post][:expire_time] = nil
    params[:post][:available] = true
    params[:post][:author_id] = current_user.id
    @post = Post.new(post_params)

    #puts(current_user.id)

    if not @post.valid? # => false
      @error_message = @post.errors.messages
      if @error_message.presence
        flash[:notice] = @error_message.values
      end

      if @post.subcategory
        @empty_subcategory = Post.get_subcategories(@post.category.to_sym)
        @current_subcategory = @post.subcategory
      else
        @empty_subcategory = Post.get_empty_subcategory
      end

      render :new
    else
      @post.save! # should not error, because it is already valid
---
INSERT INTO "posts" ("title", "price", "description", "release_time", "img_name", "author_id", "category", "subcategory", "available", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)